## Staging: lambda-api
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 4 to add, 1 to change, 4 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_appautoscaling_scheduled_action.api-5pm must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-5pm" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:239043911459:scheduledAction:ed09e774-233c-4908-b695-bec6af6749c9:resource/lambda/function:api-lambda:16:scheduledActionName/api-5pm" -> (known after apply)
      ~ id                 = "api-5pm-lambda-function:api-lambda:16" -> (known after apply)
        name               = "api-5pm"
      ~ resource_id        = "function:api-lambda:16" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_scheduled_action.api-noon must be replaced
-/+ resource "aws_appautoscaling_scheduled_action" "api-noon" {
      ~ arn                = "arn:aws:autoscaling:ca-central-1:239043911459:scheduledAction:ed09e774-233c-4908-b695-bec6af6749c9:resource/lambda/function:api-lambda:16:scheduledActionName/api-noon" -> (known after apply)
      ~ id                 = "api-noon-lambda-function:api-lambda:16" -> (known after apply)
        name               = "api-noon"
      ~ resource_id        = "function:api-lambda:16" -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_appautoscaling_target.api must be replaced
-/+ resource "aws_appautoscaling_target" "api" {
      ~ id                 = "function:api-lambda:16" -> (known after apply)
      ~ resource_id        = "function:api-lambda:16" -> (known after apply) # forces replacement
      ~ role_arn           = "arn:aws:iam::239043911459:role/aws-service-role/lambda.application-autoscaling.amazonaws.com/AWSServiceRoleForApplicationAutoScaling_LambdaConcurrency" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "api-lambda"
      ~ qualified_arn                  = "arn:aws:lambda:ca-central-1:239043911459:function:api-lambda:16" -> (known after apply)
        tags                           = {}
      ~ version                        = "16" -> (known after apply)
        # (23 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "ADMIN_BASE_URL"                        = "https://staging.notification.cdssandbox.xyz"
              + "API_HOST_NAME"                         = "https://api.staging.notification.cdssandbox.xyz"
                # (16 unchanged elements hidden)
            }
        }


        # (2 unchanged blocks hidden)
    }

  # aws_lambda_provisioned_concurrency_config.api must be replaced
-/+ resource "aws_lambda_provisioned_concurrency_config" "api" {
      ~ id                                = "api-lambda:16" -> (known after apply)
      ~ qualifier                         = "16" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"
Releasing state lock. This may take a few moments...

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.api-lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.ecr-user-access-key"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.api_lambda"]

33 tests, 16 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
